
import Foundation

final class BandsProvider : BandsProviderProtocol {
    
    static let shared = BandsProvider()
    
    private init() {
        
    }
    
    func getBands() -> [Band] {
        var bands = [Band]()
        bands.append(Band(name: "ACDC", description: "Австралийская рок-группа, сформированная в Сиднее в ноябре 1973 года выходцами из Шотландии, братьями Малькольмом и Ангусом Янгами."))
        bands.append(Band(name: "Annihilator", description: "Трэш-метал-группа, основанная в 1984 году в городе Оттава, Канада. Основателем «Annihilator» является гитарист Джефф Уотерс."))
        bands.append(Band(name: "Arch Enemy", description: "Шведская группа, играющая в стиле мелодичный дэт-метал. Была основана в 1996 году братьями Майклом и Кристофером Эмоттами. Группа Arch Enemy была образована Майклом Эмоттом (Carcass, Carnage, Spiritual Beggars) в 1996 году."))
        bands.append(Band(name: "Avenged Sevenfold", description: "американская метал-группа из Хантингтон-Бич, образованная в 1999 году. На дебютном альбоме группы — Sounding the Seventh Trumpet — преобладали панковые мотивы, а в качестве вокала часто использовался скриминг. Следующий альбом Waking the Fallen был записан в стиле металкор, с элементами хеви-метала в отдельных песнях"))
        bands.append(Band(name: "Bullet For My Valentine", description: "(в переводе с англ. — «Пуля для моей возлюбленной») — британская металкор-группа. Была сформирована в 1998 году в городе Бридженд под названием Jeff Killed John и состояла из Мэттью Така (вокал, ритм-гитара), Майкла Пэджета (соло-гитара), Ника Крэндли (бас-гитара) и Майкла Томаса (ударные). Первоначально её участники исполняли каверы на песни Metallica и Nirvana, параллельно занимаясь написанием собственного материала, по стилистике тяготевшего к ню-металу."))
        bands.append(Band(name: "Deep Purple", description: "Одна из моих самых любимых рок-групп, соло из  Highway star я учил очень долго, но таки выучил и сыграл!"))
        bands.append(Band(name: "Dethklok", description: "Дикоугарная вымышленная группа, главные герои мультсериала Metllocalypse"))
        bands.append(Band(name: "Five Finger Death Punch", description: " (с англ. — «Смертельный удар пятью пальцами», сокращённо 5FDP и FFDP) — американская грув-метал-группа, образованная в 2005 году в Лос-Анджелесе, Калифорния, Золтаном Батори, гитаристом венгерского происхождения, в прошлом — басиста U.P.O. Кроме Батори в состав группы входят бывший вокалист Motograter и Ghost Machine Айвен Муди, барабанщик Чарли Энген, басист Крис Кейл и гитарист Энди Джеймс."))
        bands.append(Band(name: "Guns'n'roses", description: "Цветы и пушки, появившись на закате эры глэм-рока эти ребята дали всем прикурить, их дебютный альбом Appetite for Destruction разашелся тиражом более 30 млн. копий"))
        bands.append(Band(name: "Hammerfall", description: "Heart ob fire hearts on fire, burning burning with desire, ух, блджад, люблю вас ребята!"))
        bands.append(Band(name: "Iron Maiden", description: "«Железная дева») — британская хеви-метал-группа, которая в начале 1980-х гг. являлась одним из известнейших представителей новой волны британского хеви-метала (NWOBHM), а позже оказала значительное влияние на развитие метала в целом."))
        bands.append(Band(name: "Judas Priest", description: "Британская хэви-метал-группа, которая наряду с такими коллективами, как Black Sabbath, Deep Purple, Led Zeppelin и Uriah Heep определила звучание хэви-метала 1970-х годов, а также оказала огромное влияние на дальнейшее развитие этого стиля в целом. За 50 лет своей карьеры музыканты продали около 50 миллионов экземпляров альбомов по всему миру[2]. В 2022 году коллектив был включён в Зал славы рок-н-ролла."))
        bands.append(Band(name: "Metallica", description: "Короли тяжелой музыки, не раз в этом убеждался лично на их концертах. Мощные риффы, классные тексты и великолепный вокал Джеймса Хетфилда делают свое грязное дело!"))
        bands.append(Band(name: "Motley Crue", description: "Антиподы трэкш металла, столько хвалы сиськам сексу и рокенроллу мало кто еще воздал!"))
        bands.append(Band(name: "Motorhead", description: "Британская хэви-метал-группа[1], оказавшая большое влияние на развитие всей тяжёлой музыки, в частности, на возникновение спид-метала, хотя отнести её музыку к этому стилю можно только с натяжкой. Музыку группы, скорее, можно охарактеризовать как сочетание хард-рока, панк-рока[2] и прото-трэша."))
        bands.append(Band(name: "Scorpions", description: " немецкая англоязычная рок-группа, созданная в 1965 в Ганновере[13]. Для стиля группы характерны как классический хард-рок, так и лирические гитарные баллады. Scorpions являются самой популярной рок-группой Германии и одной из самых известных в мире, продав более 100 миллионов копий своих альбомов (по состоянию на 29 января 2010)[14]. Коллектив занимает 46 место в списке «Величайших артистов хард-рока» по версии VH1."))
        bands.append(Band(name: "Trivium", description: "Американская метал-группа из Орландо, Флорида, образованная в 1999 году."))
        bands.append(Band(name: "W.A.S.P", description: "Американская метал-группа, образованная в 1982 году и наряду с Mötley Crüe, Ratt, Quiet Riot сформировавшая лос-анджелесскую глэм-метал-сцену. Коллектив приобрёл скандальную известность в 1980-х гг. и по-прежнему сохраняет популярность, периодически выпуская альбомы и проводя гастрольные туры."))
        bands.append(Band(name: "Yngwie Malmsteen's Rising Force", description: "Lars Johan Yngve Lannerbäck; 30 июня 1963, Стокгольм, Швеция) — шведско-американский гитарист-виртуоз, мультиинструменталист и композитор, стал одним из основоположников неоклассического метала, основав свою группу «Rising Force» в 1982 году. Ингви Мальмстин включён на 9 место в списке «10 величайших гитаристов по версии Time»[1]. Также Ингви является одним из популяризаторов техники «Свип»"))
        return bands
    }
}
